torvalds/linux/drivers/net/wireless/rockchip_wlan/rtl8723ds/hal/rtl8723d/sdio/sdio_halinit.c
/*
 * If variable not handled here,
 * some variables will be processed in GetHwReg8723D()
 */
void GetHwReg8723DS(PADAPTER padapter, u8 variable, u8 *val)
{
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(padapter);


	switch (variable) {
	case HW_VAR_CPWM:
		*val = rtw_read8(padapter, SDIO_LOCAL_BASE | SDIO_REG_HCPWM1_8723D);
		break;

	case HW_VAR_FW_PS_STATE: {
		/* 3. read dword 0x88               //driver read fw ps state */
		*((u16 *)val) = rtw_read16(padapter, 0x88);
	}
	break;
	default:
		GetHwReg8723D(padapter, variable, val);
		break;
	}

}

/*
 *	Description:
 *		Query setting of specified variable.
 *   */
u8
GetHalDefVar8723DSDIO(
	IN	PADAPTER				Adapter,
	IN	HAL_DEF_VARIABLE		eVariable,
	IN	PVOID					pValue
)
{
	struct dvobj_priv *dvobj = adapter_to_dvobj(Adapter);
	PSDIO_DATA psdio_data = NULL;
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(Adapter);
	u8			bResult = _SUCCESS;

	switch (eVariable) {
	case HAL_DEF_IS_SUPPORT_ANT_DIV:
#ifdef CONFIG_ANTENNA_DIVERSITY
		*((u8 *)pValue) = _FALSE;
#endif
		break;

	case HW_VAR_MAX_RX_AMPDU_FACTOR:
		/* Stanley@BB.SD3 suggests 16K can get stable performance */
		/* coding by Lucas@20130730 */
		psdio_data = &dvobj->intf_data;
		if (psdio_data->clock > RTW_SDIO_CLK_40M)
			*(HT_CAP_AMPDU_FACTOR *)pValue = MAX_AMPDU_FACTOR_32K;
		else
			*(HT_CAP_AMPDU_FACTOR *)pValue = MAX_AMPDU_FACTOR_16K;
		break;
		*(HT_CAP_AMPDU_FACTOR *)pValue = MAX_AMPDU_FACTOR_16K;
		break;
	default:
		bResult = GetHalDefVar8723D(Adapter, eVariable, pValue);
		break;
	}

	return bResult;
}

/*
 *	Description:
 *		Change default setting of specified variable.
 *   */
u8
SetHalDefVar8723DSDIO(
	IN	PADAPTER				Adapter,
	IN	HAL_DEF_VARIABLE		eVariable,
	IN	PVOID					pValue
)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(Adapter);
	u8			bResult = _SUCCESS;

	switch (eVariable) {
	default:
		bResult = SetHalDefVar8723D(Adapter, eVariable, pValue);
		break;
	}

	return bResult;
}

void rtl8723ds_set_hal_ops(PADAPTER padapter)
{
	struct hal_ops *pHalFunc = &padapter->hal_func;


	rtl8723d_set_hal_ops(pHalFunc);

	pHalFunc->hal_power_on = &_InitPowerOn_8723DS;
	pHalFunc->hal_power_off = &CardDisableRTL8723DSdio;


	pHalFunc->hal_init = &rtl8723ds_hal_init;
	pHalFunc->hal_deinit = &rtl8723ds_hal_deinit;

	pHalFunc->init_xmit_priv = &rtl8723ds_init_xmit_priv;
	pHalFunc->free_xmit_priv = &rtl8723ds_free_xmit_priv;

	pHalFunc->init_recv_priv = &rtl8723ds_init_recv_priv;
	pHalFunc->free_recv_priv = &rtl8723ds_free_recv_priv;
#ifdef CONFIG_RECV_THREAD_MODE
	pHalFunc->recv_hdl = rtl8723ds_recv_hdl;
#endif /* CONFIG_RECV_THREAD_MODE */
#ifdef CONFIG_RTW_SW_LED
	pHalFunc->InitSwLeds = &rtl8723ds_InitSwLeds;
	pHalFunc->DeInitSwLeds = &rtl8723ds_DeInitSwLeds;
#endif
	pHalFunc->init_default_value = &rtl8723ds_init_default_value;
	pHalFunc->intf_chip_configure = &rtl8723ds_interface_configure;
	pHalFunc->read_adapter_info = &ReadAdapterInfo8723DS;

	pHalFunc->enable_interrupt = &EnableInterrupt8723DSdio;
	pHalFunc->disable_interrupt = &DisableInterrupt8723DSdio;
	pHalFunc->check_ips_status = &CheckIPSStatus;
#if defined(CONFIG_WOWLAN) || defined(CONFIG_AP_WOWLAN)
	pHalFunc->clear_interrupt = &ClearInterrupt8723DSdio;
#endif
	pHalFunc->set_hw_reg_handler = &SetHwReg8723DS;
	pHalFunc->GetHwRegHandler = &GetHwReg8723DS;
	pHalFunc->get_hal_def_var_handler = &GetHalDefVar8723DSDIO;
	pHalFunc->SetHalDefVarHandler = &SetHalDefVar8723DSDIO;

	pHalFunc->hal_xmit = &rtl8723ds_hal_xmit;
	pHalFunc->mgnt_xmit = &rtl8723ds_mgnt_xmit;
	pHalFunc->hal_xmitframe_enqueue = &rtl8723ds_hal_xmitframe_enqueue;

#ifdef CONFIG_HOSTAPD_MLME
	pHalFunc->hostap_mgnt_xmit_entry = NULL;
#endif

#if defined(CONFIG_CHECK_BT_HANG) && defined(CONFIG_BT_COEXIST)
	pHalFunc->hal_init_checkbthang_workqueue =
		&rtl8723ds_init_checkbthang_workqueue;
	pHalFunc->hal_free_checkbthang_workqueue =
		&rtl8723ds_free_checkbthang_workqueue;
	pHalFunc->hal_cancle_checkbthang_workqueue =
		&rtl8723ds_cancle_checkbthang_workqueue;
	pHalFunc->hal_checke_bt_hang = &rtl8723ds_hal_check_bt_hang;
#endif

}
